Revit 2027 API
SurfaceElementExtension Enumeration
 Presets for given Analytical Extension.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SurfaceElementExtension
Public Enumeration SurfaceElementExtension
public enum class SurfaceElementExtension
type SurfaceElementExtension
Members
Member name | Value | Description
BottomOrTop | 0 |  Bottom or Top of physical element.
Plane | 1 |  Use a Plane for extension (e.g., Grid, Level).
See Also
Reference
Autodesk.Revit.DB.Structure Namespace